 CTFとは、Capture The Flag(旗取りゲーム)の略で、用意されたWebサイトなどからFlagと呼ばれる情報を探し出し、合計点数を競うハッキングコンテストのことです。
 問題形式は、クイズ形式のJeopardyの他に、擬似的な攻防戦を行うAttack-Defenseがあります。
 #[Link]
 (https://www.nri-secure.co.jp/glossary/ctf)
主な問題ジャンルは、webアプリケーションの脆弱性をつくwebや、暗号を解読するCryptoなどがあります。
 元々は、ラスベガスで開催されるコンピュータセキュリティ会議DEF CONの余興として始まりましたが、現在では世界中で開催されています。日本では、２０１２年にCTFチャレンジジャパンを開始したのが初めてで、その後もSECCONなどのCTFが開催されています。
#[Link]
(https://ja.wikipedia.org/wiki/%E3%82%AD%E3%83%A3%E3%83%97%E3%83%81%E3%83%A3%E3%83%BC%E3%83%BB%E3%82%B6%E3%83%BB%E3%83%95%E3%83%A9%E3%83%83%E3%82%B0)
CTFを通じて、実践的な経験や知識、チームで協力する力が得られ、キャリアアップにも役に立ちます。
　学習サイトもあり、初心者向けのものもあります。
この講義では、問題形式やジャンルごとに模擬のCTFをやって、CTFがどんな内容かをちゃんと理解したいと思います。
